##Урок №4 задание 5
temper1 = float(input("введите первое температуру: "))
temper2 = float(input("введите второе температуру: "))
temper3 = float(input("введите третье температуру: "))

if temper1 == 0 and temper2 == 0 and temper3 == 0:
    print("температуры равны на таяния льда")
elif temper1 == 0 and temper2 == 0:
    print("первое и второе температуры равны на таяния льда")
elif temper1 == 0 and temper3 == 0:
    print("первое и третье температуры равны на таяния льда")
elif temper2 == 0 and temper3 == 0:
    print("второе и третье температуры равны на таяния льда")
elif temper1 == 0:
    print("первое температура равно на таяния льда")
elif temper2 == 0:
    print("второе температура равно на таяния льда")
elif temper3 == 0:
    print("третьий температура равно на таяние льда")
else:
    print("такие температуратуры не равняется на таяние льда ")