##Урок №4 задание 8
month = int(input('ведите число от 1 до 12: '))

if month == 1:
    print('месяц Январь коичество дней:31')
elif month == 2:
    print('месяц Февраль количество дней:28')
elif month == 3:
    print('месяц Март количество дней:31')
elif month == 4:
    print('месяц Апрель количество дней:30')
elif month == 5:
    print('месяц Май количество дней:31')
elif month == 6:
    print('месяц Июнь количество дней:30')
elif month == 7:
    print('месяц Июль количество дней:31')
elif month == 8:
    print('месяц Август количество дней:31')
elif month == 9:
    print('месяц Сентябрь количество дней:30')
elif month == 10:
    print('месяц Октябрь количество дней:31')
elif month == 11:
    print('месяц Ноябрь количество дней:30')
elif month == 12:
    print('месяц Декабрь количество дней:31')
else:
    print('простите не мог найти такую цыфру или месяц:(')